OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
/**************************************************************************//**
 * @file     clk.h
 * @version  V1.00
 * @brief    CLK driver header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#ifndef __CLK_H__
#define __CLK_H__

#ifdef __cplusplus
extern "C"
{
#endif

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup CLK_Driver CLK Driver
  @{
*/

/** @addtogroup CLK_EXPORTED_CONSTANTS CLK Exported Constants
  @{
*/

/*---------------------------------------------------------------------------------------------------------*/
/*  Frequency constant definitions.                                                                        */
/*---------------------------------------------------------------------------------------------------------*/
#define FREQ_1MHZ          1000000UL    /*!< 1 MHz \hideinitializer */
#define FREQ_2MHZ          2000000UL    /*!< 2 MHz \hideinitializer */
#define FREQ_4MHZ          4000000UL    /*!< 4 MHz \hideinitializer */
#define FREQ_8MHZ          8000000UL    /*!< 8 MHz \hideinitializer */
#define FREQ_12MHZ         12000000UL   /*!< 12 MHz \hideinitializer */
#define FREQ_24MHZ         24000000UL   /*!< 24 MHz \hideinitializer */
#define FREQ_25MHZ         25000000UL   /*!< 25 MHz \hideinitializer */
#define FREQ_36MHZ         36000000UL   /*!< 36 MHz \hideinitializer */
#define FREQ_40MHZ         40000000UL   /*!< 40 MHz \hideinitializer */
#define FREQ_45MHZ         45000000UL   /*!< 45 MHz \hideinitializer */
#define FREQ_50MHZ         50000000UL   /*!< 50 MHz \hideinitializer */
#define FREQ_72MHZ         72000000UL   /*!< 72 MHz \hideinitializer */
#define FREQ_75MHZ         75000000UL   /*!< 75 MHz \hideinitializer */
#define FREQ_80MHZ         80000000UL   /*!< 80 MHz \hideinitializer */
#define FREQ_90MHZ         90000000UL   /*!< 90 MHz \hideinitializer */
#define FREQ_100MHZ        100000000UL  /*!< 100 MHz \hideinitializer */
#define FREQ_120MHZ        120000000UL  /*!< 120 MHz \hideinitializer */
#define FREQ_125MHZ        125000000UL  /*!< 125 MHz \hideinitializer */
#define FREQ_144MHZ        144000000UL  /*!< 144 MHz \hideinitializer */
#define FREQ_150MHZ        150000000UL  /*!< 150 MHz \hideinitializer */
#define FREQ_160MHZ        160000000UL  /*!< 160 MHz \hideinitializer */
#define FREQ_175MHZ        175000000UL  /*!< 175 MHz \hideinitializer */
#define FREQ_180MHZ        180000000UL  /*!< 180 MHz \hideinitializer */
#define FREQ_192MHZ        192000000UL  /*!< 192 MHz \hideinitializer */
#define FREQ_200MHZ        200000000UL  /*!< 200 MHz \hideinitializer */
#define FREQ_220MHZ        220000000UL  /*!< 220 MHz \hideinitializer */
#define FREQ_225MHZ        225000000UL  /*!< 225 MHz \hideinitializer */
#define FREQ_240MHZ        240000000UL  /*!< 240 MHz \hideinitializer */
#define FREQ_384MHZ        384000000UL  /*!< 384 MHz \hideinitializer */
#define FREQ_500MHZ        500000000UL  /*!< 500 MHz \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  MIRC constant definitions.                                                                             */
/*---------------------------------------------------------------------------------------------------------*/
#define CLK_MIRCCTL_MIRCFSEL_1MHZ    (0x0UL << CLK_MIRCCTL_MIRCFSEL_Pos)          /*!< Select MIRC clock to 1 MHz \hideinitializer */
#define CLK_MIRCCTL_MIRCFSEL_2MHZ    (0x1UL << CLK_MIRCCTL_MIRCFSEL_Pos)          /*!< Select MIRC clock to 1 MHz \hideinitializer */
#define CLK_MIRCCTL_MIRCFSEL_4MHZ    (0x2UL << CLK_MIRCCTL_MIRCFSEL_Pos)          /*!< Select MIRC clock to 1 MHz \hideinitializer */
#define CLK_MIRCCTL_MIRCFSEL_8MHZ    (0x3UL << CLK_MIRCCTL_MIRCFSEL_Pos)          /*!< Select MIRC clock to 1 MHz \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  CLKSEL constant definitions.  (Write-protection)                                                       */
/*---------------------------------------------------------------------------------------------------------*/
#define CLK_SCLKSEL_SCLKSEL_HIRC            (0x0UL << CLK_SCLKSEL_SCLKSEL_Pos)          /*!< Select System clock source from HIRC \hideinitializer */
#define CLK_SCLKSEL_SCLKSEL_MIRC            (0x1UL << CLK_SCLKSEL_SCLKSEL_Pos)          /*!< Select System clock source from MIRC \hideinitializer */
#define CLK_SCLKSEL_SCLKSEL_HIRC48M         (0x2UL << CLK_SCLKSEL_SCLKSEL_Pos)          /*!< Select System clock source from HIRC48M \hideinitializer */
#define CLK_SCLKSEL_SCLKSEL_HXT             (0x3UL << CLK_SCLKSEL_SCLKSEL_Pos)          /*!< Select System clock source from HXT \hideinitializer */
#define CLK_SCLKSEL_SCLKSEL_APLL0           (0x4UL << CLK_SCLKSEL_SCLKSEL_Pos)          /*!< Select System clock source from APLL0 \hideinitializer */

#define CLK_BPWMSEL_BPWM0SEL_PCLK0          (0x0UL << CLK_BPWMSEL_BPWM0SEL_Pos)         /*!< Select BPWM0 clock source from PCLK0 \hideinitializer */
#define CLK_BPWMSEL_BPWM0SEL_HCLK0          (0x1UL << CLK_BPWMSEL_BPWM0SEL_Pos)         /*!< Select BPWM0 clock source from HCLK0 \hideinitializer */

#define CLK_BPWMSEL_BPWM1SEL_PCLK2          (0x0UL << CLK_BPWMSEL_BPWM1SEL_Pos)         /*!< Select BPWM1 clock source from PCLK2 \hideinitializer */
#define CLK_BPWMSEL_BPWM1SEL_HCLK0          (0x1UL << CLK_BPWMSEL_BPWM1SEL_Pos)         /*!< Select BPWM1 clock source from HCLK0 \hideinitializer */

#define CLK_CANFDSEL_CANFD0SEL_HXT          (0x0UL << CLK_CANFDSEL_CANFD0SEL_Pos)       /*!< Select CANFD0 clock source from HXT \hideinitializer */
#define CLK_CANFDSEL_CANFD0SEL_APLL0_DIV2   (0x1UL << CLK_CANFDSEL_CANFD0SEL_Pos)       /*!< Select CANFD0 clock source from APLL0/2 \hideinitializer */
#define CLK_CANFDSEL_CANFD0SEL_HCLK0        (0x2UL << CLK_CANFDSEL_CANFD0SEL_Pos)       /*!< Select CANFD0 clock source from HCLK0 \hideinitializer */
#define CLK_CANFDSEL_CANFD0SEL_HIRC         (0x3UL << CLK_CANFDSEL_CANFD0SEL_Pos)       /*!< Select CANFD0 clock source from HIRC \hideinitializer */
#define CLK_CANFDSEL_CANFD0SEL_HIRC48M_DIV4 (0x4UL << CLK_CANFDSEL_CANFD0SEL_Pos)       /*!< Select CANFD0 clock source from HIRC48M/4 \hideinitializer */

