OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define CLK_CANFDSEL_CANFD1SEL_HXT          (0x0UL << CLK_CANFDSEL_CANFD1SEL_Pos)       /*!< Select CANFD1 clock source from HXT \hideinitializer */
#define CLK_CANFDSEL_CANFD1SEL_APLL0_DIV2   (0x1UL << CLK_CANFDSEL_CANFD1SEL_Pos)       /*!< Select CANFD1 clock source from APLL0/2 \hideinitializer */
#define CLK_CANFDSEL_CANFD1SEL_HCLK0        (0x2UL << CLK_CANFDSEL_CANFD1SEL_Pos)       /*!< Select CANFD1 clock source from HCLK0 \hideinitializer */
#define CLK_CANFDSEL_CANFD1SEL_HIRC         (0x3UL << CLK_CANFDSEL_CANFD1SEL_Pos)       /*!< Select CANFD1 clock source from HIRC \hideinitializer */
#define CLK_CANFDSEL_CANFD1SEL_HIRC48M_DIV4 (0x4UL << CLK_CANFDSEL_CANFD1SEL_Pos)       /*!< Select CANFD1 clock source from HIRC48M/4 \hideinitializer */

#define CLK_CCAPSEL_CCAP0SEL_MIRC           (0x0UL << CLK_CCAPSEL_CCAP0SEL_Pos)         /*!< Select CCAP sensor clock source from MIRC \hideinitializer */
#define CLK_CCAPSEL_CCAP0SEL_HCLK2          (0x1UL << CLK_CCAPSEL_CCAP0SEL_Pos)         /*!< Select CCAP sensor clock source from HCLK2 \hideinitializer */
#define CLK_CCAPSEL_CCAP0SEL_HIRC           (0x2UL << CLK_CCAPSEL_CCAP0SEL_Pos)         /*!< Select CCAP sensor clock source from HIRC \hideinitializer */
#define CLK_CCAPSEL_CCAP0SEL_APLL0_DIV2     (0x3UL << CLK_CCAPSEL_CCAP0SEL_Pos)         /*!< Select CCAP sensor clock source from APLL0/2 \hideinitializer */
#define CLK_CCAPSEL_CCAP0SEL_HXT            (0x4UL << CLK_CCAPSEL_CCAP0SEL_Pos)         /*!< Select CCAP sensor clock source from HXT \hideinitializer */

#define CLK_CLKOSEL_CLKOSEL_SYSCLK          (0x0UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from SYSCLK \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_ACLK            (0x1UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from ACLK \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_HCLK0           (0x2UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from HCLK0 \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_HCLK1           (0x3UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from HCLK1 \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_HCLK2           (0x4UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from HCLK2 \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_APLL0_DIV2      (0x5UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from APLL0/2 \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_APLL1_DIV2      (0x6UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from APLL1/2 \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_HIRC48M         (0x7UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from HIRC48M \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_HXT             (0x8UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from HXT \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_HIRC            (0x9UL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from HIRC \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_MIRC            (0xaUL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from MIRC \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_LXT             (0xbUL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from LXT \hideinitializer */
#define CLK_CLKOSEL_CLKOSEL_LIRC            (0xcUL << CLK_CLKOSEL_CLKOSEL_Pos)          /*!< Select CLKO clock source from LIRC \hideinitializer */

#define CLK_DMICSEL_DMIC0SEL_HXT            (0x0UL << CLK_DMICSEL_DMIC0SEL_Pos)         /*!< Select DMIC clock source from HXT \hideinitializer */
#define CLK_DMICSEL_DMIC0SEL_APLL1_DIV2     (0x1UL << CLK_DMICSEL_DMIC0SEL_Pos)         /*!< Select DMIC clock source from APLL1/2 \hideinitializer */
#define CLK_DMICSEL_DMIC0SEL_MIRC           (0x2UL << CLK_DMICSEL_DMIC0SEL_Pos)         /*!< Select DMIC clock source from MIRC \hideinitializer */
#define CLK_DMICSEL_DMIC0SEL_HIRC           (0x3UL << CLK_DMICSEL_DMIC0SEL_Pos)         /*!< Select DMIC clock source from HIRC \hideinitializer */
#define CLK_DMICSEL_DMIC0SEL_HIRC48M        (0x4UL << CLK_DMICSEL_DMIC0SEL_Pos)         /*!< Select DMIC clock source from HIRC48M \hideinitializer */
#define CLK_DMICSEL_DMIC0SEL_PCLK4          (0x5UL << CLK_DMICSEL_DMIC0SEL_Pos)         /*!< Select DMIC clock source from PCLK4 \hideinitializer */
#define CLK_DMICSEL_VAD0SEL_PCLK4           (0x0UL << CLK_DMICSEL_VAD0SEL_Pos)          /*!< Select VAD clock source from PCLK4 \hideinitializer */
#define CLK_DMICSEL_VAD0SEL_MIRC            (0x1UL << CLK_DMICSEL_VAD0SEL_Pos)          /*!< Select VAD clock source from MIRC \hideinitializer */
#define CLK_DMICSEL_VAD0SEL_HIRC            (0x2UL << CLK_DMICSEL_VAD0SEL_Pos)          /*!< Select VAD clock source from HIRC \hideinitializer */

#define CLK_EADCSEL_EADC0SEL_APLL1_DIV2     (0x0UL << CLK_EADCSEL_EADC0SEL_Pos)         /*!< Select EADC0 clock source from APLL1/2 \hideinitializer */
#define CLK_EADCSEL_EADC0SEL_APLL0_DIV2     (0x1UL << CLK_EADCSEL_EADC0SEL_Pos)         /*!< Select EADC0 clock source from APLL0/2 \hideinitializer */
#define CLK_EADCSEL_EADC0SEL_PCLK0          (0x2UL << CLK_EADCSEL_EADC0SEL_Pos)         /*!< Select EADC0 clock source from PCLK0 \hideinitializer */

#define CLK_EPWMSEL_EPWM0SEL_PCLK0          (0x0UL << CLK_EPWMSEL_EPWM0SEL_Pos)         /*!< Select EPWM0 clock source from PCLK0 \hideinitializer */
#define CLK_EPWMSEL_EPWM0SEL_HCLK0          (0x1UL << CLK_EPWMSEL_EPWM0SEL_Pos)         /*!< Select EPWM0 clock source from HCLK0 \hideinitializer */

#define CLK_EPWMSEL_EPWM1SEL_PCLK2          (0x0UL << CLK_EPWMSEL_EPWM1SEL_Pos)         /*!< Select EPWM1 clock source from PCLK2 \hideinitializer */
#define CLK_EPWMSEL_EPWM1SEL_HCLK0          (0x1UL << CLK_EPWMSEL_EPWM1SEL_Pos)         /*!< Select EPWM1 clock source from HCLK0 \hideinitializer */

#define CLK_FMCSEL_FMC0SEL_HIRC             (0x0UL << CLK_FMCSEL_FMC0SEL_Pos)           /*!< Select FMC clock source from HIRC \hideinitializer */
#define CLK_FMCSEL_FMC0SEL_HIRC48M_DIV4     (0x1UL << CLK_FMCSEL_FMC0SEL_Pos)           /*!< Select FMC clock source from HIRC48M/4 \hideinitializer */

#define CLK_I2SSEL_I2S0SEL_HXT              (0x0UL << CLK_I2SSEL_I2S0SEL_Pos)           /*!< Select I2S0 clock source from HXT \hideinitializer */
#define CLK_I2SSEL_I2S0SEL_APLL1_DIV2       (0x1UL << CLK_I2SSEL_I2S0SEL_Pos)           /*!< Select I2S0 clock source from APLL1/2 \hideinitializer */
#define CLK_I2SSEL_I2S0SEL_APLL0_DIV2       (0x2UL << CLK_I2SSEL_I2S0SEL_Pos)           /*!< Select I2S0 clock source from APLL0/2 \hideinitializer */
#define CLK_I2SSEL_I2S0SEL_PCLK1            (0x3UL << CLK_I2SSEL_I2S0SEL_Pos)           /*!< Select I2S0 clock source from PCLK1 \hideinitializer */
#define CLK_I2SSEL_I2S0SEL_HIRC             (0x4UL << CLK_I2SSEL_I2S0SEL_Pos)           /*!< Select I2S0 clock source from HIRC \hideinitializer */
#define CLK_I2SSEL_I2S0SEL_HIRC48M          (0x5UL << CLK_I2SSEL_I2S0SEL_Pos)           /*!< Select I2S0 clock source from HIRC48M \hideinitializer */

#define CLK_I2SSEL_I2S1SEL_HXT              (0x0UL << CLK_I2SSEL_I2S1SEL_Pos)           /*!< Select I2S1 clock source from HXT \hideinitializer */
#define CLK_I2SSEL_I2S1SEL_APLL1_DIV2       (0x1UL << CLK_I2SSEL_I2S1SEL_Pos)           /*!< Select I2S1 clock source from APLL0/2 \hideinitializer */
#define CLK_I2SSEL_I2S1SEL_APLL0_DIV2       (0x2UL << CLK_I2SSEL_I2S1SEL_Pos)           /*!< Select I2S1 clock source from APLL1/2 \hideinitializer */
#define CLK_I2SSEL_I2S1SEL_PCLK3            (0x3UL << CLK_I2SSEL_I2S1SEL_Pos)           /*!< Select I2S1 clock source from PCLK3 \hideinitializer */
#define CLK_I2SSEL_I2S1SEL_HIRC             (0x4UL << CLK_I2SSEL_I2S1SEL_Pos)           /*!< Select I2S1 clock source from HIRC \hideinitializer */
#define CLK_I2SSEL_I2S1SEL_HIRC48M          (0x5UL << CLK_I2SSEL_I2S1SEL_Pos)           /*!< Select I2S1 clock source from HIRC48M \hideinitializer */

