OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define CLK_I3CSEL_I3C0SEL_HCLK0            (0x0UL << CLK_I3CSEL_I3C0SEL_Pos)           /*!< Select I2S1 clock source from HCLK0 \hideinitializer */
#define CLK_I3CSEL_I3C0SEL_APLL1            (0x1UL << CLK_I3CSEL_I3C0SEL_Pos)           /*!< Select I2S1 clock source from APLL1 \hideinitializer */

#define CLK_KPISEL_KPI0SEL_HIRC48M_DIV4     (0x0UL << CLK_KPISEL_KPI0SEL_Pos)           /*!< Select KPI clock source from HIRC48M/4 \hideinitializer */
#define CLK_KPISEL_KPI0SEL_HIRC             (0x1UL << CLK_KPISEL_KPI0SEL_Pos)           /*!< Select KPI clock source from HIRC \hideinitializer */
#define CLK_KPISEL_KPI0SEL_LIRC             (0x2UL << CLK_KPISEL_KPI0SEL_Pos)           /*!< Select KPI clock source from LIRC \hideinitializer */
#define CLK_KPISEL_KPI0SEL_HXT              (0x3UL << CLK_KPISEL_KPI0SEL_Pos)           /*!< Select KPI clock source from HXT \hideinitializer */

#define CLK_LPADCSEL_LPADC0SEL_PCLK4        (0x0UL << CLK_LPADCSEL_LPADC0SEL_Pos)       /*!< Select LPADC0 clock source from PCLK2 \hideinitializer */
#define CLK_LPADCSEL_LPADC0SEL_LXT          (0x1UL << CLK_LPADCSEL_LPADC0SEL_Pos)       /*!< Select LPADC0 clock source from LXT \hideinitializer */
#define CLK_LPADCSEL_LPADC0SEL_MIRC         (0x2UL << CLK_LPADCSEL_LPADC0SEL_Pos)       /*!< Select LPADC0 clock source from MIRC \hideinitializer */
#define CLK_LPADCSEL_LPADC0SEL_HIRC         (0x3UL << CLK_LPADCSEL_LPADC0SEL_Pos)       /*!< Select LPADC0 clock source from HIRC \hideinitializer */

#define CLK_LPSPISEL_LPSPI0SEL_PCLK4        (0x0UL << CLK_LPSPISEL_LPSPI0SEL_Pos)       /*!< Select LPSPI0 clock source from PCLK4 \hideinitializer */
#define CLK_LPSPISEL_LPSPI0SEL_MIRC         (0x1UL << CLK_LPSPISEL_LPSPI0SEL_Pos)       /*!< Select LPSPI0 clock source from MIRC \hideinitializer */
#define CLK_LPSPISEL_LPSPI0SEL_HIRC         (0x2UL << CLK_LPSPISEL_LPSPI0SEL_Pos)       /*!< Select LPSPI0 clock source from HIRC \hideinitializer */

#define CLK_LPTMRSEL_LPTMR0SEL_PCLK4        (0x0UL << CLK_LPTMRSEL_LPTMR0SEL_Pos)       /*!< Select LPTMR0 clock source from PCLK4 \hideinitializer */
#define CLK_LPTMRSEL_LPTMR0SEL_LXT          (0x1UL << CLK_LPTMRSEL_LPTMR0SEL_Pos)       /*!< Select LPTMR0 clock source from LXT \hideinitializer */
#define CLK_LPTMRSEL_LPTMR0SEL_LIRC         (0x2UL << CLK_LPTMRSEL_LPTMR0SEL_Pos)       /*!< Select LPTMR0 clock source from LIRC \hideinitializer */
#define CLK_LPTMRSEL_LPTMR0SEL_MIRC         (0x3UL << CLK_LPTMRSEL_LPTMR0SEL_Pos)       /*!< Select LPTMR0 clock source from MIRC \hideinitializer */
#define CLK_LPTMRSEL_LPTMR0SEL_HIRC         (0x4UL << CLK_LPTMRSEL_LPTMR0SEL_Pos)       /*!< Select LPTMR0 clock source from HIRC \hideinitializer */
#define CLK_LPTMRSEL_LPTMR0SEL_EXT          (0x5UL << CLK_LPTMRSEL_LPTMR0SEL_Pos)       /*!< Select LPTMR0 clock source from external trigger \hideinitializer */

#define CLK_LPTMRSEL_LPTMR1SEL_PCLK4        (0x0UL << CLK_LPTMRSEL_LPTMR1SEL_Pos)       /*!< Select LPTMR1 clock source from PCLK4 \hideinitializer */
#define CLK_LPTMRSEL_LPTMR1SEL_LXT          (0x1UL << CLK_LPTMRSEL_LPTMR1SEL_Pos)       /*!< Select LPTMR1 clock source from LXT \hideinitializer */
#define CLK_LPTMRSEL_LPTMR1SEL_LIRC         (0x2UL << CLK_LPTMRSEL_LPTMR1SEL_Pos)       /*!< Select LPTMR1 clock source from LIRC \hideinitializer */
#define CLK_LPTMRSEL_LPTMR1SEL_MIRC         (0x3UL << CLK_LPTMRSEL_LPTMR1SEL_Pos)       /*!< Select LPTMR1 clock source from MIRC \hideinitializer */
#define CLK_LPTMRSEL_LPTMR1SEL_HIRC         (0x4UL << CLK_LPTMRSEL_LPTMR1SEL_Pos)       /*!< Select LPTMR1 clock source from HIRC \hideinitializer */
#define CLK_LPTMRSEL_LPTMR1SEL_EXT          (0x5UL << CLK_LPTMRSEL_LPTMR1SEL_Pos)       /*!< Select LPTMR1 clock source from external trigger \hideinitializer */

#define CLK_LPUARTSEL_LPUART0SEL_PCLK4      (0x0UL << CLK_LPUARTSEL_LPUART0SEL_Pos)     /*!< Select LPUART0 clock source from PCLK4 \hideinitializer */
#define CLK_LPUARTSEL_LPUART0SEL_LXT        (0x1UL << CLK_LPUARTSEL_LPUART0SEL_Pos)     /*!< Select LPUART0 clock source from LXT \hideinitializer */
#define CLK_LPUARTSEL_LPUART0SEL_MIRC       (0x2UL << CLK_LPUARTSEL_LPUART0SEL_Pos)     /*!< Select LPUART0 clock source from MIRC \hideinitializer */
#define CLK_LPUARTSEL_LPUART0SEL_HIRC       (0x3UL << CLK_LPUARTSEL_LPUART0SEL_Pos)     /*!< Select LPUART0 clock source from HIRC \hideinitializer */

#define CLK_PSIOSEL_PSIO0SEL_LXT            (0x0UL << CLK_PSIOSEL_PSIO0SEL_Pos)         /*!< Select PSIO clock source from LXT \hideinitializer */
#define CLK_PSIOSEL_PSIO0SEL_HXT            (0x1UL << CLK_PSIOSEL_PSIO0SEL_Pos)         /*!< Select PSIO clock source from HXT \hideinitializer */
#define CLK_PSIOSEL_PSIO0SEL_LIRC           (0x2UL << CLK_PSIOSEL_PSIO0SEL_Pos)         /*!< Select PSIO clock source from LIRC \hideinitializer */
#define CLK_PSIOSEL_PSIO0SEL_HIRC           (0x3UL << CLK_PSIOSEL_PSIO0SEL_Pos)         /*!< Select PSIO clock source from HIRC \hideinitializer */
#define CLK_PSIOSEL_PSIO0SEL_HIRC48M_DIV4   (0x4UL << CLK_PSIOSEL_PSIO0SEL_Pos)         /*!< Select PSIO clock source from HIRC48M/4 \hideinitializer */
#define CLK_PSIOSEL_PSIO0SEL_PCLK1          (0x5UL << CLK_PSIOSEL_PSIO0SEL_Pos)         /*!< Select PSIO clock source from PCLK1 \hideinitializer */
#define CLK_PSIOSEL_PSIO0SEL_APLL0_DIV2     (0x6UL << CLK_PSIOSEL_PSIO0SEL_Pos)         /*!< Select PSIO clock source from APLL0/2 \hideinitializer */

#define CLK_QSPISEL_QSPI0SEL_HXT            (0x0UL << CLK_QSPISEL_QSPI0SEL_Pos)         /*!< Select QSPI0 clock source from HXT \hideinitializer */
#define CLK_QSPISEL_QSPI0SEL_APLL0_DIV2     (0x1UL << CLK_QSPISEL_QSPI0SEL_Pos)         /*!< Select QSPI0 clock source from APLL0/2 \hideinitializer */
#define CLK_QSPISEL_QSPI0SEL_PCLK0          (0x2UL << CLK_QSPISEL_QSPI0SEL_Pos)         /*!< Select QSPI0 clock source from PCLK0 \hideinitializer */
#define CLK_QSPISEL_QSPI0SEL_HIRC           (0x3UL << CLK_QSPISEL_QSPI0SEL_Pos)         /*!< Select QSPI0 clock source from HIRC \hideinitializer */
#define CLK_QSPISEL_QSPI0SEL_HIRC48M_DIV4   (0x4UL << CLK_QSPISEL_QSPI0SEL_Pos)         /*!< Select QSPI0 clock source from HIRC48M/4 \hideinitializer */

