OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define CLK_QSPISEL_QSPI1SEL_HXT            (0x0UL << CLK_QSPISEL_QSPI1SEL_Pos)         /*!< Select QSPI1 clock source from HXT \hideinitializer */
#define CLK_QSPISEL_QSPI1SEL_APLL0_DIV2     (0x1UL << CLK_QSPISEL_QSPI1SEL_Pos)         /*!< Select QSPI1 clock source from APLL0/2 \hideinitializer */
#define CLK_QSPISEL_QSPI1SEL_PCLK2          (0x2UL << CLK_QSPISEL_QSPI1SEL_Pos)         /*!< Select QSPI1 clock source from PCLK2 \hideinitializer */
#define CLK_QSPISEL_QSPI1SEL_HIRC           (0x3UL << CLK_QSPISEL_QSPI1SEL_Pos)         /*!< Select QSPI1 clock source from HIRC \hideinitializer */
#define CLK_QSPISEL_QSPI1SEL_HIRC48M_DIV4   (0x4UL << CLK_QSPISEL_QSPI1SEL_Pos)         /*!< Select QSPI1 clock source from HIRC48M/4 \hideinitializer */

#define CLK_SCSEL_SC0SEL_HXT                (0x0UL << CLK_SCSEL_SC0SEL_Pos)             /*!< Select SC0 clock source from HXT \hideinitializer */
#define CLK_SCSEL_SC0SEL_APLL0_DIV2         (0x1UL << CLK_SCSEL_SC0SEL_Pos)             /*!< Select SC0 clock source from APLL0/2 \hideinitializer */
#define CLK_SCSEL_SC0SEL_PCLK1              (0x2UL << CLK_SCSEL_SC0SEL_Pos)             /*!< Select SC0 clock source from PCLK1 \hideinitializer */
#define CLK_SCSEL_SC0SEL_HIRC               (0x3UL << CLK_SCSEL_SC0SEL_Pos)             /*!< Select SC0 clock source from HIRC \hideinitializer */
#define CLK_SCSEL_SC0SEL_HIRC48M_DIV4       (0x4UL << CLK_SCSEL_SC0SEL_Pos)             /*!< Select SC0 clock source from HIRC48M/4 \hideinitializer */

#define CLK_SCSEL_SC1SEL_HXT                (0x0UL << CLK_SCSEL_SC1SEL_Pos)             /*!< Select SC1 clock source from HXT \hideinitializer */
#define CLK_SCSEL_SC1SEL_APLL0_DIV2         (0x1UL << CLK_SCSEL_SC1SEL_Pos)             /*!< Select SC1 clock source from APLL0/2 \hideinitializer */
#define CLK_SCSEL_SC1SEL_PCLK3              (0x2UL << CLK_SCSEL_SC1SEL_Pos)             /*!< Select SC1 clock source from PCLK3 \hideinitializer */
#define CLK_SCSEL_SC1SEL_HIRC               (0x3UL << CLK_SCSEL_SC1SEL_Pos)             /*!< Select SC1 clock source from HIRC \hideinitializer */
#define CLK_SCSEL_SC1SEL_HIRC48M_DIV4       (0x4UL << CLK_SCSEL_SC1SEL_Pos)             /*!< Select SC1 clock source from HIRC48M/4 \hideinitializer */

#define CLK_SCSEL_SC2SEL_HXT                (0x0UL << CLK_SCSEL_SC2SEL_Pos)             /*!< Select SC2 clock source from HXT \hideinitializer */
#define CLK_SCSEL_SC2SEL_APLL0_DIV2         (0x1UL << CLK_SCSEL_SC2SEL_Pos)             /*!< Select SC2 clock source from APLL0/2 \hideinitializer */
#define CLK_SCSEL_SC2SEL_PCLK1              (0x2UL << CLK_SCSEL_SC2SEL_Pos)             /*!< Select SC2 clock source from PCLK1 \hideinitializer */
#define CLK_SCSEL_SC2SEL_HIRC               (0x3UL << CLK_SCSEL_SC2SEL_Pos)             /*!< Select SC2 clock source from HIRC \hideinitializer */
#define CLK_SCSEL_SC2SEL_HIRC48M_DIV4       (0x4UL << CLK_SCSEL_SC2SEL_Pos)             /*!< Select SC2 clock source from HIRC48M/4 \hideinitializer */

#define CLK_SDHSEL_SDH0SEL_HXT              (0x0UL << CLK_SDHSEL_SDH0SEL_Pos)           /*!< Select SDH0 clock source from HXT \hideinitializer */
#define CLK_SDHSEL_SDH0SEL_APLL1_DIV2       (0x1UL << CLK_SDHSEL_SDH0SEL_Pos)           /*!< Select SDH0 clock source from APLL1/2 \hideinitializer */
#define CLK_SDHSEL_SDH0SEL_HCLK0            (0x2UL << CLK_SDHSEL_SDH0SEL_Pos)           /*!< Select SDH0 clock source from HCLK0 \hideinitializer */
#define CLK_SDHSEL_SDH0SEL_HIRC             (0x3UL << CLK_SDHSEL_SDH0SEL_Pos)           /*!< Select SDH0 clock source from HIRC \hideinitializer */
#define CLK_SDHSEL_SDH0SEL_HIRC48M_DIV4     (0x4UL << CLK_SDHSEL_SDH0SEL_Pos)           /*!< Select SDH0 clock source from HIRC48M/4 \hideinitializer */

#define CLK_SDHSEL_SDH1SEL_HXT              (0x0UL << CLK_SDHSEL_SDH1SEL_Pos)           /*!< Select SDH1 clock source from HXT \hideinitializer */
#define CLK_SDHSEL_SDH1SEL_APLL1_DIV2       (0x1UL << CLK_SDHSEL_SDH1SEL_Pos)           /*!< Select SDH1 clock source from APLL1/2 \hideinitializer */
#define CLK_SDHSEL_SDH1SEL_HCLK0            (0x2UL << CLK_SDHSEL_SDH1SEL_Pos)           /*!< Select SDH1 clock source from HCLK0 \hideinitializer */
#define CLK_SDHSEL_SDH1SEL_HIRC             (0x3UL << CLK_SDHSEL_SDH1SEL_Pos)           /*!< Select SDH1 clock source from HIRC \hideinitializer */
#define CLK_SDHSEL_SDH1SEL_HIRC48M_DIV4     (0x4UL << CLK_SDHSEL_SDH1SEL_Pos)           /*!< Select SDH1 clock source from HIRC48M/4 \hideinitializer */

#define CLK_SPISEL_SPI0SEL_HXT              (0x0UL << CLK_SPISEL_SPI0SEL_Pos)           /*!< Select SPI0 clock source from HXT \hideinitializer */
#define CLK_SPISEL_SPI0SEL_APLL1_DIV2       (0x1UL << CLK_SPISEL_SPI0SEL_Pos)           /*!< Select SPI0 clock source from APLL1/2 \hideinitializer */
#define CLK_SPISEL_SPI0SEL_APLL0_DIV2       (0x2UL << CLK_SPISEL_SPI0SEL_Pos)           /*!< Select SPI0 clock source from APLL0/2 \hideinitializer */
#define CLK_SPISEL_SPI0SEL_PCLK0            (0x3UL << CLK_SPISEL_SPI0SEL_Pos)           /*!< Select SPI0 clock source from PCLK0 \hideinitializer */
#define CLK_SPISEL_SPI0SEL_HIRC             (0x4UL << CLK_SPISEL_SPI0SEL_Pos)           /*!< Select SPI0 clock source from HIRC \hideinitializer */
#define CLK_SPISEL_SPI0SEL_HIRC48M          (0x5UL << CLK_SPISEL_SPI0SEL_Pos)           /*!< Select SPI0 clock source from HIRC48M \hideinitializer */

#define CLK_SPISEL_SPI1SEL_HXT              (0x0UL << CLK_SPISEL_SPI1SEL_Pos)           /*!< Select SPI1 clock source from HXT \hideinitializer */
#define CLK_SPISEL_SPI1SEL_APLL1_DIV2       (0x1UL << CLK_SPISEL_SPI1SEL_Pos)           /*!< Select SPI1 clock source from APLL1/2 \hideinitializer */
#define CLK_SPISEL_SPI1SEL_APLL0_DIV2       (0x2UL << CLK_SPISEL_SPI1SEL_Pos)           /*!< Select SPI1 clock source from APLL0/2 \hideinitializer */
#define CLK_SPISEL_SPI1SEL_PCLK2            (0x3UL << CLK_SPISEL_SPI1SEL_Pos)           /*!< Select SPI1 clock source from PCLK2 \hideinitializer */
#define CLK_SPISEL_SPI1SEL_HIRC             (0x4UL << CLK_SPISEL_SPI1SEL_Pos)           /*!< Select SPI1 clock source from HIRC \hideinitializer */
#define CLK_SPISEL_SPI1SEL_HIRC48M          (0x5UL << CLK_SPISEL_SPI1SEL_Pos)           /*!< Select SPI1 clock source from HIRC48M \hideinitializer */

#define CLK_SPISEL_SPI2SEL_HXT              (0x0UL << CLK_SPISEL_SPI2SEL_Pos)           /*!< Select SPI2 clock source from HXT \hideinitializer */
#define CLK_SPISEL_SPI2SEL_APLL1_DIV2       (0x1UL << CLK_SPISEL_SPI2SEL_Pos)           /*!< Select SPI2 clock source from APLL1/2 \hideinitializer */
#define CLK_SPISEL_SPI2SEL_APLL0_DIV2       (0x2UL << CLK_SPISEL_SPI2SEL_Pos)           /*!< Select SPI2 clock source from APLL0/2 \hideinitializer */
#define CLK_SPISEL_SPI2SEL_PCLK0            (0x3UL << CLK_SPISEL_SPI2SEL_Pos)           /*!< Select SPI2 clock source from PCLK0 \hideinitializer */
#define CLK_SPISEL_SPI2SEL_HIRC             (0x4UL << CLK_SPISEL_SPI2SEL_Pos)           /*!< Select SPI2 clock source from HIRC \hideinitializer */
#define CLK_SPISEL_SPI2SEL_HIRC48M          (0x5UL << CLK_SPISEL_SPI2SEL_Pos)           /*!< Select SPI2 clock source from HIRC48M \hideinitializer */

#define CLK_SPISEL_SPI3SEL_HXT              (0x0UL << CLK_SPISEL_SPI3SEL_Pos)           /*!< Select SPI3 clock source from HXT \hideinitializer */
#define CLK_SPISEL_SPI3SEL_APLL1_DIV2       (0x1UL << CLK_SPISEL_SPI3SEL_Pos)           /*!< Select SPI3 clock source from APLL1/2 \hideinitializer */
#define CLK_SPISEL_SPI3SEL_APLL0_DIV2       (0x2UL << CLK_SPISEL_SPI3SEL_Pos)           /*!< Select SPI3 clock source from APLL0/2 \hideinitializer */
#define CLK_SPISEL_SPI3SEL_PCLK2            (0x3UL << CLK_SPISEL_SPI3SEL_Pos)           /*!< Select SPI3 clock source from PCLK0 \hideinitializer */
#define CLK_SPISEL_SPI3SEL_HIRC             (0x4UL << CLK_SPISEL_SPI3SEL_Pos)           /*!< Select SPI3 clock source from HIRC \hideinitializer */
#define CLK_SPISEL_SPI3SEL_HIRC48M          (0x5UL << CLK_SPISEL_SPI3SEL_Pos)           /*!< Select SPI3 clock source from HIRC48M \hideinitializer */

#define CLK_STSEL_ST0SEL_HXT                (0x0UL << CLK_STSEL_ST0SEL_Pos)             /*!< Select SysTick 0 clock source from HXT \hideinitializer */
#define CLK_STSEL_ST0SEL_HXT_DIV2           (0x1UL << CLK_STSEL_ST0SEL_Pos)             /*!< Select SysTick 0 clock source from HXT/2 \hideinitializer */
#define CLK_STSEL_ST0SEL_ACLK_DIV2          (0x2UL << CLK_STSEL_ST0SEL_Pos)             /*!< Select SysTick 0 clock source from ACLK/2 \hideinitializer */
#define CLK_STSEL_ST0SEL_HIRC_DIV2          (0x3UL << CLK_STSEL_ST0SEL_Pos)             /*!< Select SysTick 0 clock source from HIRC/2 \hideinitializer */
#define CLK_STSEL_ACLK                      (0x8UL)                                     /*!< Select SysTick 0 clock source from ACLK \hideinitializer */

