OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define CLK_TMRSEL_TMR0SEL_HXT              (0x0UL << CLK_TMRSEL_TMR0SEL_Pos)           /*!< Select TMR0 clock source from HXT \hideinitializer */
#define CLK_TMRSEL_TMR0SEL_LXT              (0x1UL << CLK_TMRSEL_TMR0SEL_Pos)           /*!< Select TMR0 clock source from LXT \hideinitializer */
#define CLK_TMRSEL_TMR0SEL_PCLK1            (0x2UL << CLK_TMRSEL_TMR0SEL_Pos)           /*!< Select TMR0 clock source from PCLK1 \hideinitializer */
#define CLK_TMRSEL_TMR0SEL_EXT              (0x3UL << CLK_TMRSEL_TMR0SEL_Pos)           /*!< Select TMR0 clock source from external trigger \hideinitializer */
#define CLK_TMRSEL_TMR0SEL_LIRC             (0x4UL << CLK_TMRSEL_TMR0SEL_Pos)           /*!< Select TMR0 clock source from LIRC \hideinitializer */
#define CLK_TMRSEL_TMR0SEL_HIRC             (0x5UL << CLK_TMRSEL_TMR0SEL_Pos)           /*!< Select TMR0 clock source from HIRC \hideinitializer */
#define CLK_TMRSEL_TMR0SEL_HIRC48M_DIV4     (0x6UL << CLK_TMRSEL_TMR0SEL_Pos)           /*!< Select TMR0 clock source from HIRC48M/4 \hideinitializer */

#define CLK_TMRSEL_TMR1SEL_HXT              (0x0UL << CLK_TMRSEL_TMR1SEL_Pos)           /*!< Select TMR1 clock source from HXT \hideinitializer */
#define CLK_TMRSEL_TMR1SEL_LXT              (0x1UL << CLK_TMRSEL_TMR1SEL_Pos)           /*!< Select TMR1 clock source from LXT \hideinitializer */
#define CLK_TMRSEL_TMR1SEL_PCLK1            (0x2UL << CLK_TMRSEL_TMR1SEL_Pos)           /*!< Select TMR1 clock source from PCLK1 \hideinitializer */
#define CLK_TMRSEL_TMR1SEL_EXT              (0x3UL << CLK_TMRSEL_TMR1SEL_Pos)           /*!< Select TMR1 clock source from external trigger \hideinitializer */
#define CLK_TMRSEL_TMR1SEL_LIRC             (0x4UL << CLK_TMRSEL_TMR1SEL_Pos)           /*!< Select TMR1 clock source from LIRC \hideinitializer */
#define CLK_TMRSEL_TMR1SEL_HIRC             (0x5UL << CLK_TMRSEL_TMR1SEL_Pos)           /*!< Select TMR1 clock source from HIRC \hideinitializer */
#define CLK_TMRSEL_TMR1SEL_HIRC48M_DIV4     (0x6UL << CLK_TMRSEL_TMR1SEL_Pos)           /*!< Select TMR1 clock source from HIRC48M/4 \hideinitializer */

#define CLK_TMRSEL_TMR2SEL_HXT              (0x0UL << CLK_TMRSEL_TMR2SEL_Pos)           /*!< Select TMR2 clock source from HXT \hideinitializer */
#define CLK_TMRSEL_TMR2SEL_LXT              (0x1UL << CLK_TMRSEL_TMR2SEL_Pos)           /*!< Select TMR2 clock source from LXT \hideinitializer */
#define CLK_TMRSEL_TMR2SEL_PCLK3            (0x2UL << CLK_TMRSEL_TMR2SEL_Pos)           /*!< Select TMR2 clock source from PCLK3 \hideinitializer */
#define CLK_TMRSEL_TMR2SEL_EXT              (0x3UL << CLK_TMRSEL_TMR2SEL_Pos)           /*!< Select TMR2 clock source from external trigger \hideinitializer */
#define CLK_TMRSEL_TMR2SEL_LIRC             (0x4UL << CLK_TMRSEL_TMR2SEL_Pos)           /*!< Select TMR2 clock source from LIRC \hideinitializer */
#define CLK_TMRSEL_TMR2SEL_HIRC             (0x5UL << CLK_TMRSEL_TMR2SEL_Pos)           /*!< Select TMR2 clock source from HIRC \hideinitializer */
#define CLK_TMRSEL_TMR2SEL_HIRC48M_DIV4     (0x6UL << CLK_TMRSEL_TMR2SEL_Pos)           /*!< Select TMR2 clock source from HIRC48M/4 \hideinitializer */

#define CLK_TMRSEL_TMR3SEL_HXT              (0x0UL << CLK_TMRSEL_TMR3SEL_Pos)           /*!< Select TMR3 clock source from HXT \hideinitializer */
#define CLK_TMRSEL_TMR3SEL_LXT              (0x1UL << CLK_TMRSEL_TMR3SEL_Pos)           /*!< Select TMR3 clock source from LXT \hideinitializer */
#define CLK_TMRSEL_TMR3SEL_PCLK3            (0x2UL << CLK_TMRSEL_TMR3SEL_Pos)           /*!< Select TMR3 clock source from PCLK3 \hideinitializer */
#define CLK_TMRSEL_TMR3SEL_EXT              (0x3UL << CLK_TMRSEL_TMR3SEL_Pos)           /*!< Select TMR3 clock source from external trigger \hideinitializer */
#define CLK_TMRSEL_TMR3SEL_LIRC             (0x4UL << CLK_TMRSEL_TMR3SEL_Pos)           /*!< Select TMR3 clock source from LIRC \hideinitializer */
#define CLK_TMRSEL_TMR3SEL_HIRC             (0x5UL << CLK_TMRSEL_TMR3SEL_Pos)           /*!< Select TMR3 clock source from HIRC \hideinitializer */
#define CLK_TMRSEL_TMR3SEL_HIRC48M_DIV4     (0x6UL << CLK_TMRSEL_TMR3SEL_Pos)           /*!< Select TMR3 clock source from HIRC48M/4 \hideinitializer */

#define CLK_TTMRSEL_TTMR0SEL_PCLK4          (0x0UL << CLK_TTMRSEL_TTMR0SEL_Pos)         /*!< Select TTMR0 clock source from PCLK4 \hideinitializer */
#define CLK_TTMRSEL_TTMR0SEL_LXT            (0x1UL << CLK_TTMRSEL_TTMR0SEL_Pos)         /*!< Select TTMR0 clock source from LXT \hideinitializer */
#define CLK_TTMRSEL_TTMR0SEL_LIRC           (0x2UL << CLK_TTMRSEL_TTMR0SEL_Pos)         /*!< Select TTMR0 clock source from LIRC \hideinitializer */
#define CLK_TTMRSEL_TTMR0SEL_MIRC           (0x3UL << CLK_TTMRSEL_TTMR0SEL_Pos)         /*!< Select TTMR0 clock source from MIRC \hideinitializer */
#define CLK_TTMRSEL_TTMR0SEL_HIRC           (0x4UL << CLK_TTMRSEL_TTMR0SEL_Pos)         /*!< Select TTMR0 clock source from HIRC \hideinitializer */

#define CLK_TTMRSEL_TTMR1SEL_PCLK4          (0x0UL << CLK_TTMRSEL_TTMR1SEL_Pos)         /*!< Select TTMR1 clock source from PCLK4 \hideinitializer */
#define CLK_TTMRSEL_TTMR1SEL_LXT            (0x1UL << CLK_TTMRSEL_TTMR1SEL_Pos)         /*!< Select TTMR1 clock source from LXT \hideinitializer */
#define CLK_TTMRSEL_TTMR1SEL_LIRC           (0x2UL << CLK_TTMRSEL_TTMR1SEL_Pos)         /*!< Select TTMR1 clock source from LIRC \hideinitializer */
#define CLK_TTMRSEL_TTMR1SEL_MIRC           (0x3UL << CLK_TTMRSEL_TTMR1SEL_Pos)         /*!< Select TTMR1 clock source from MIRC \hideinitializer */
#define CLK_TTMRSEL_TTMR1SEL_HIRC           (0x4UL << CLK_TTMRSEL_TTMR1SEL_Pos)         /*!< Select TTMR1 clock source from HIRC \hideinitializer */

#define CLK_UARTSEL0_UART0SEL_HXT           (0x0UL << CLK_UARTSEL0_UART0SEL_Pos)        /*!< Select UART0 clock source from HXT \hideinitializer */
#define CLK_UARTSEL0_UART0SEL_HIRC          (0x1UL << CLK_UARTSEL0_UART0SEL_Pos)        /*!< Select UART0 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL0_UART0SEL_LXT           (0x2UL << CLK_UARTSEL0_UART0SEL_Pos)        /*!< Select UART0 clock source from LXT \hideinitializer */
#define CLK_UARTSEL0_UART0SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL0_UART0SEL_Pos)        /*!< Select UART0 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL0_UART0SEL_HIRC48M       (0x4UL << CLK_UARTSEL0_UART0SEL_Pos)        /*!< Select UART0 clock source from HIRC48M \hideinitializer */

#define CLK_UARTSEL0_UART1SEL_HXT           (0x0UL << CLK_UARTSEL0_UART1SEL_Pos)        /*!< Select UART1 clock source from HXT \hideinitializer */
#define CLK_UARTSEL0_UART1SEL_HIRC          (0x1UL << CLK_UARTSEL0_UART1SEL_Pos)        /*!< Select UART1 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL0_UART1SEL_LXT           (0x2UL << CLK_UARTSEL0_UART1SEL_Pos)        /*!< Select UART1 clock source from LXT \hideinitializer */
#define CLK_UARTSEL0_UART1SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL0_UART1SEL_Pos)        /*!< Select UART1 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL0_UART1SEL_HIRC48M       (0x4UL << CLK_UARTSEL0_UART1SEL_Pos)        /*!< Select UART1 clock source from HIRC48M \hideinitializer */

