OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define CLK_UARTSEL0_UART2SEL_HXT           (0x0UL << CLK_UARTSEL0_UART2SEL_Pos)        /*!< Select UART2 clock source from HXT \hideinitializer */
#define CLK_UARTSEL0_UART2SEL_HIRC          (0x1UL << CLK_UARTSEL0_UART2SEL_Pos)        /*!< Select UART2 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL0_UART2SEL_LXT           (0x2UL << CLK_UARTSEL0_UART2SEL_Pos)        /*!< Select UART2 clock source from LXT \hideinitializer */
#define CLK_UARTSEL0_UART2SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL0_UART2SEL_Pos)        /*!< Select UART2 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL0_UART2SEL_HIRC48M       (0x4UL << CLK_UARTSEL0_UART2SEL_Pos)        /*!< Select UART2 clock source from HIRC48M \hideinitializer */

#define CLK_UARTSEL0_UART3SEL_HXT           (0x0UL << CLK_UARTSEL0_UART3SEL_Pos)        /*!< Select UART3 clock source from HXT \hideinitializer */
#define CLK_UARTSEL0_UART3SEL_HIRC          (0x1UL << CLK_UARTSEL0_UART3SEL_Pos)        /*!< Select UART3 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL0_UART3SEL_LXT           (0x2UL << CLK_UARTSEL0_UART3SEL_Pos)        /*!< Select UART3 clock source from LXT \hideinitializer */
#define CLK_UARTSEL0_UART3SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL0_UART3SEL_Pos)        /*!< Select UART3 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL0_UART3SEL_HIRC48M       (0x4UL << CLK_UARTSEL0_UART3SEL_Pos)        /*!< Select UART3 clock source from HIRC48M \hideinitializer */

#define CLK_UARTSEL0_UART4SEL_HXT           (0x0UL << CLK_UARTSEL0_UART4SEL_Pos)        /*!< Select UART4 clock source from HXT \hideinitializer */
#define CLK_UARTSEL0_UART4SEL_HIRC          (0x1UL << CLK_UARTSEL0_UART4SEL_Pos)        /*!< Select UART4 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL0_UART4SEL_LXT           (0x2UL << CLK_UARTSEL0_UART4SEL_Pos)        /*!< Select UART4 clock source from LXT \hideinitializer */
#define CLK_UARTSEL0_UART4SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL0_UART4SEL_Pos)        /*!< Select UART4 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL0_UART4SEL_HIRC48M       (0x4UL << CLK_UARTSEL0_UART4SEL_Pos)        /*!< Select UART4 clock source from HIRC48M \hideinitializer */

#define CLK_UARTSEL0_UART5SEL_HXT           (0x0UL << CLK_UARTSEL0_UART5SEL_Pos)        /*!< Select UART5 clock source from HXT \hideinitializer */
#define CLK_UARTSEL0_UART5SEL_HIRC          (0x1UL << CLK_UARTSEL0_UART5SEL_Pos)        /*!< Select UART5 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL0_UART5SEL_LXT           (0x2UL << CLK_UARTSEL0_UART5SEL_Pos)        /*!< Select UART5 clock source from LXT \hideinitializer */
#define CLK_UARTSEL0_UART5SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL0_UART5SEL_Pos)        /*!< Select UART5 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL0_UART5SEL_HIRC48M       (0x4UL << CLK_UARTSEL0_UART5SEL_Pos)        /*!< Select UART5 clock source from HIRC48M \hideinitializer */

#define CLK_UARTSEL0_UART6SEL_HXT           (0x0UL << CLK_UARTSEL0_UART6SEL_Pos)        /*!< Select UART6 clock source from HXT \hideinitializer */
#define CLK_UARTSEL0_UART6SEL_HIRC          (0x1UL << CLK_UARTSEL0_UART6SEL_Pos)        /*!< Select UART6 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL0_UART6SEL_LXT           (0x2UL << CLK_UARTSEL0_UART6SEL_Pos)        /*!< Select UART6 clock source from LXT \hideinitializer */
#define CLK_UARTSEL0_UART6SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL0_UART6SEL_Pos)        /*!< Select UART6 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL0_UART6SEL_HIRC48M       (0x4UL << CLK_UARTSEL0_UART6SEL_Pos)        /*!< Select UART6 clock source from HIRC48M \hideinitializer */

#define CLK_UARTSEL0_UART7SEL_HXT           (0x0UL << CLK_UARTSEL0_UART7SEL_Pos)        /*!< Select UART7 clock source from HXT \hideinitializer */
#define CLK_UARTSEL0_UART7SEL_HIRC          (0x1UL << CLK_UARTSEL0_UART7SEL_Pos)        /*!< Select UART7 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL0_UART7SEL_LXT           (0x2UL << CLK_UARTSEL0_UART7SEL_Pos)        /*!< Select UART7 clock source from LXT \hideinitializer */
#define CLK_UARTSEL0_UART7SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL0_UART7SEL_Pos)        /*!< Select UART7 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL0_UART7SEL_HIRC48M       (0x4UL << CLK_UARTSEL0_UART7SEL_Pos)        /*!< Select UART7 clock source from HIRC48M \hideinitializer */

#define CLK_UARTSEL1_UART8SEL_HXT           (0x0UL << CLK_UARTSEL1_UART8SEL_Pos)        /*!< Select UART8 clock source from HXT \hideinitializer */
#define CLK_UARTSEL1_UART8SEL_HIRC          (0x1UL << CLK_UARTSEL1_UART8SEL_Pos)        /*!< Select UART8 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL1_UART8SEL_LXT           (0x2UL << CLK_UARTSEL1_UART8SEL_Pos)        /*!< Select UART8 clock source from LXT \hideinitializer */
#define CLK_UARTSEL1_UART8SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL1_UART8SEL_Pos)        /*!< Select UART8 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL1_UART8SEL_HIRC48M       (0x4UL << CLK_UARTSEL1_UART8SEL_Pos)        /*!< Select UART8 clock source from HIRC48M \hideinitializer */

#define CLK_UARTSEL1_UART9SEL_HXT           (0x0UL << CLK_UARTSEL1_UART9SEL_Pos)        /*!< Select UART9 clock source from HXT \hideinitializer */
#define CLK_UARTSEL1_UART9SEL_HIRC          (0x1UL << CLK_UARTSEL1_UART9SEL_Pos)        /*!< Select UART9 clock source from HIRC \hideinitializer */
#define CLK_UARTSEL1_UART9SEL_LXT           (0x2UL << CLK_UARTSEL1_UART9SEL_Pos)        /*!< Select UART9 clock source from LXT \hideinitializer */
#define CLK_UARTSEL1_UART9SEL_APLL0_DIV2    (0x3UL << CLK_UARTSEL1_UART9SEL_Pos)        /*!< Select UART9 clock source from APLL0/2 \hideinitializer */
#define CLK_UARTSEL1_UART9SEL_HIRC48M       (0x4UL << CLK_UARTSEL1_UART9SEL_Pos)        /*!< Select UART9 clock source from HIRC48M \hideinitializer */

