OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define CLK_USBSEL_USBSEL_HIRC48M           (0x0UL << CLK_USBSEL_USBSEL_Pos)            /*!< Select USB clock source from HIRC48M \hideinitializer */
#define CLK_USBSEL_USBSEL_APLL1_DIV2        (0x1UL << CLK_USBSEL_USBSEL_Pos)            /*!< Select USB clock source from APLL1/2 \hideinitializer */

#define CLK_WDTSEL_WDT0SEL_LXT              (0x0UL << CLK_WDTSEL_WDT0SEL_Pos)           /*!< Select WDT0 clock source from LXT \hideinitializer */
#define CLK_WDTSEL_WDT0SEL_LIRC             (0x1UL << CLK_WDTSEL_WDT0SEL_Pos)           /*!< Select WDT0 clock source from LIRC \hideinitializer */

#define CLK_WDTSEL_WDT1SEL_LXT              (0x0UL << CLK_WDTSEL_WDT1SEL_Pos)           /*!< Select WDT1 clock source from LXT \hideinitializer */
#define CLK_WDTSEL_WDT1SEL_LIRC             (0x1UL << CLK_WDTSEL_WDT1SEL_Pos)           /*!< Select WDT1 clock source from LIRC \hideinitializer */

#define CLK_WWDTSEL_WWDT0SEL_LIRC           (0x0UL << CLK_WWDTSEL_WWDT0SEL_Pos)         /*!< Select WWDT0 clock source from LIRC \hideinitializer */
#define CLK_WWDTSEL_WWDT0SEL_LXT            (0x1UL << CLK_WWDTSEL_WWDT0SEL_Pos)         /*!< Select WWDT0 clock source from LXT \hideinitializer */

#define CLK_WWDTSEL_WWDT1SEL_LIRC           (0x0UL << CLK_WWDTSEL_WWDT1SEL_Pos)         /*!< Select WWDT1 clock source from LIRC \hideinitializer */
#define CLK_WWDTSEL_WWDT1SEL_LXT            (0x1UL << CLK_WWDTSEL_WWDT1SEL_Pos)         /*!< Select WWDT1 clock source from LXT \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  RTC clock source constant definitions.                                                                 */
/*---------------------------------------------------------------------------------------------------------*/
#define RTC_LXTCTL_RTCCKSEL_LXT          (0x0UL<<RTC_LXTCTL_RTCCKSEL_Pos)           /*!< Setting RTC clock source as LXT \hideinitializer */
#define RTC_LXTCTL_RTCCKSEL_LIRC         (0x1UL<<RTC_LXTCTL_RTCCKSEL_Pos)           /*!< Setting RTC clock source as LIRC \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  CLKDIV constant definitions.                                                                          */
/*---------------------------------------------------------------------------------------------------------*/
#define CLK_SCLKDIV_SCLKDIV(x)              (((x) - 1UL) << CLK_SCLKDIV_SCLKDIV_Pos)        /*!< SCLKDIV Setting for SCLK clock divider. It could be 1~16 \hideinitializer */
#define CLK_HCLKDIV_HCLK2DIV(x)             (((x) - 1UL) << CLK_HCLKDIV_HCLK2DIV_Pos)       /*!< HCLKDIV Setting for HCLK2 clock divider. It could be 1~16 \hideinitializer */
#define CLK_PCLKDIV_PCLK0DIV(x)             (((x) - 1UL) << CLK_PCLKDIV_PCLK0DIV_Pos)       /*!< PCLKDIV Setting for PCLK0 clock divider. It could be 1~16 \hideinitializer */
#define CLK_PCLKDIV_PCLK1DIV(x)             (((x) - 1UL) << CLK_PCLKDIV_PCLK1DIV_Pos)       /*!< PCLKDIV Setting for PCLK1 clock divider. It could be 1~16 \hideinitializer */
#define CLK_PCLKDIV_PCLK2DIV(x)             (((x) - 1UL) << CLK_PCLKDIV_PCLK2DIV_Pos)       /*!< PCLKDIV Setting for PCLK2 clock divider. It could be 1~16 \hideinitializer */
#define CLK_PCLKDIV_PCLK3DIV(x)             (((x) - 1UL) << CLK_PCLKDIV_PCLK3DIV_Pos)       /*!< PCLKDIV Setting for PCLK3 clock divider. It could be 1~16 \hideinitializer */
#define CLK_PCLKDIV_PCLK4DIV(x)             (((x) - 1UL) << CLK_PCLKDIV_PCLK4DIV_Pos)       /*!< PCLKDIV Setting for PCLK4 clock divider. It could be 1~16 \hideinitializer */

#define CLK_STDIV_ST0DIV(x)                 (((x) - 1UL) << CLK_STDIV_ST0DIV_Pos)           /*!< STDIV Setting for ST0 clock divider. It could be 1~256 \hideinitializer */

#define CLK_CANFDDIV_CANFD0DIV(x)           (((x) - 1UL) << CLK_CANFDDIV_CANFD0DIV_Pos)     /*!< CANFDDIV Setting for CANFD0 clock divider. It could be 1~256 \hideinitializer */
#define CLK_CANFDDIV_CANFD1DIV(x)           (((x) - 1UL) << CLK_CANFDDIV_CANFD1DIV_Pos)     /*!< CANFDDIV Setting for CANFD1 clock divider. It could be 1~256 \hideinitializer */

#define CLK_DMICDIV_DMIC0DIV(x)            (((x) - 1UL) << CLK_DMICDIV_DMIC0DIV_Pos)        /*!< DMICDIV Setting for DMIC0 clock divider. It could be 1~256 \hideinitializer */

#define CLK_EADCDIV_EADC0DIV(x)             (((x) - 1UL) << CLK_EADCDIV_EADC0DIV_Pos)       /*!< CANFDDIV Setting for EADC0 clock divider. It could be 1~256 \hideinitializer */

#define CLK_I2SDIV_I2S0DIV(x)               (((x) - 1UL) << CLK_I2SDIV_I2S0DIV_Pos)         /*!< I2SDIV Setting for I2S0 clock divider. It could be 1~256 \hideinitializer */
#define CLK_I2SDIV_I2S1DIV(x)               (((x) - 1UL) << CLK_I2SDIV_I2S1DIV_Pos)         /*!< I2SDIV Setting for I2S1 clock divider. It could be 1~256 \hideinitializer */

#define CLK_KPIDIV_KPI0DIV(x)               (((x) - 1UL) << CLK_KPIDIV_KPI0DIV_Pos)         /*!< KPIDIV Setting for KPI clock divider. It could be 1~256 \hideinitializer */

#define CLK_LPADCDIV_LPADC0DIV(x)           (((x) - 1UL) << CLK_LPADCDIV_LPADC0DIV_Pos)     /*!< LPADCDIV Setting for LPADC clock divider. It could be 1~16 \hideinitializer */

#define CLK_LPUARTDIV_LPUART0DIV(x)         (((x) - 1UL) << CLK_LPUARTDIV_LPUART0DIV_Pos)   /*!< LPUARTDIV Setting for LPUART clock divider. It could be 1~16 \hideinitializer */

#define CLK_PSIODIV_PSIO0DIV(x)             (((x) - 1UL) << CLK_PSIODIV_PSIO0DIV_Pos)       /*!< PSIODIV Setting for PSIO clock divider. It could be 1~16 \hideinitializer */

#define CLK_SCDIV_SC0DIV(x)                 (((x) - 1UL) << CLK_SCDIV_SC0DIV_Pos)           /*!< SCDIV Setting for SC0 clock divider. It could be 1~16 \hideinitializer */
#define CLK_SCDIV_SC1DIV(x)                 (((x) - 1UL) << CLK_SCDIV_SC1DIV_Pos)           /*!< SCDIV Setting for SC1 clock divider. It could be 1~16 \hideinitializer */
#define CLK_SCDIV_SC2DIV(x)                 (((x) - 1UL) << CLK_SCDIV_SC2DIV_Pos)           /*!< SCDIV Setting for SC2 clock divider. It could be 1~16 \hideinitializer */

#define CLK_SDHDIV_SDH0DIV(x)               (((x) - 1UL) << CLK_SDHDIV_SDH0DIV_Pos)         /*!< SDHDIV Setting for SDH0 clock divider. It could be 1~16 \hideinitializer */
#define CLK_SDHDIV_SDH1DIV(x)               (((x) - 1UL) << CLK_SDHDIV_SDH1DIV_Pos)         /*!< SDHDIV Setting for SDH1 clock divider. It could be 1~16 \hideinitializer */

#define CLK_UARTDIV0_UART0DIV(x)            (((x) - 1UL) << CLK_UARTDIV0_UART0DIV_Pos)      /*!< UARTDIV0 Setting for UART0 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV0_UART1DIV(x)            (((x) - 1UL) << CLK_UARTDIV0_UART1DIV_Pos)      /*!< UARTDIV0 Setting for UART1 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV0_UART2DIV(x)            (((x) - 1UL) << CLK_UARTDIV0_UART2DIV_Pos)      /*!< UARTDIV0 Setting for UART2 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV0_UART3DIV(x)            (((x) - 1UL) << CLK_UARTDIV0_UART3DIV_Pos)      /*!< UARTDIV0 Setting for UART3 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV0_UART4DIV(x)            (((x) - 1UL) << CLK_UARTDIV0_UART4DIV_Pos)      /*!< UARTDIV0 Setting for UART4 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV0_UART5DIV(x)            (((x) - 1UL) << CLK_UARTDIV0_UART5DIV_Pos)      /*!< UARTDIV0 Setting for UART5 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV0_UART6DIV(x)            (((x) - 1UL) << CLK_UARTDIV0_UART6DIV_Pos)      /*!< UARTDIV0 Setting for UART6 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV0_UART7DIV(x)            (((x) - 1UL) << CLK_UARTDIV0_UART7DIV_Pos)      /*!< UARTDIV0 Setting for UART7 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV1_UART8DIV(x)            (((x) - 1UL) << CLK_UARTDIV1_UART8DIV_Pos)      /*!< UARTDIV1 Setting for UART8 clock divider. It could be 1~16 \hideinitializer */
#define CLK_UARTDIV1_UART9DIV(x)            (((x) - 1UL) << CLK_UARTDIV1_UART9DIV_Pos)      /*!< UARTDIV1 Setting for UART9 clock divider. It could be 1~16 \hideinitializer */

#define CLK_USBDIV_USBDIV(x)                (((x) - 1UL) << CLK_USBDIV_USBDIV_Pos)          /*!< USBDIV Setting for USB clock divider. It could be 1~16 \hideinitializer */

#define CLK_VSENSEDIV_VSENSEDIV(x)          (((x) - 1UL) << CLK_VSENSEDIV_VSENSEDIV_Pos)    /*!< VSENSEDIV Setting for VSENSE clock divider. It could be 1~256 \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  APLLCTL constant definitions. APLL = FIN * 2 * NF / NR / NO                                              */
/*---------------------------------------------------------------------------------------------------------*/
#define CLK_APLL0_SELECT     0UL
#define CLK_APLL1_SELECT     1UL

