OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define CLK_APLLCTL_APLLSRC_HXT           0x00000000UL    /*!< For APLL clock source is HXT.       4MHz < FIN/NR < 8MHz \hideinitializer */
#define CLK_APLLCTL_APLLSRC_HXT_DIV2      0x00000001UL    /*!< For APLL clock source is HXT/2.     4MHz < FIN/NR < 8MHz \hideinitializer */
#define CLK_APLLCTL_APLLSRC_HIRC          0x00000002UL    /*!< For APLL clock source is HIRC.      4MHz < FIN/NR < 8MHz \hideinitializer */
#define CLK_APLLCTL_APLLSRC_HIRC48_DIV4   0x00000003UL    /*!< For APLL clock source is HIRC48/4.  4MHz < FIN/NR < 8MHz \hideinitializer */

#define CLK_APLLCTL_NF(x)        (((x)-2UL))       /*!< x must be constant and 2 <= x <= 513.    200MHz < FIN*2*NF/NR < 500MHz. \hideinitializer */
#define CLK_APLLCTL_NR(x)        (((x)-1UL)<<9)    /*!< x must be constant and 1 <= x <= 32.     4MHz < FIN/NR < 8MHz \hideinitializer */

#define CLK_APLLCTL_NO_1         0x0000UL        /*!< For output divider is 1 \hideinitializer */
#define CLK_APLLCTL_NO_2         0x4000UL        /*!< For output divider is 2 \hideinitializer */
#define CLK_APLLCTL_NO_4         0xC000UL        /*!< For output divider is 4 \hideinitializer */

#define CLK_APLLCTL_72MHz           (CLK_APLLCTL_NR(3UL) | CLK_APLLCTL_NF( 36UL) | CLK_APLLCTL_NO_4) /*!< Predefined APLLCTL setting for 72MHz APLL output with 12MHz \hideinitializer */
#define CLK_APLLCTL_80MHz           (CLK_APLLCTL_NR(3UL) | CLK_APLLCTL_NF( 40UL) | CLK_APLLCTL_NO_4) /*!< Predefined APLLCTL setting for 80MHz APLL output with 12MHz \hideinitializer */
#define CLK_APLLCTL_144MHz          (CLK_APLLCTL_NR(2UL) | CLK_APLLCTL_NF( 24UL) | CLK_APLLCTL_NO_2) /*!< Predefined APLLCTL setting for 144MHz APLL output with 12MHz \hideinitializer */
#define CLK_APLLCTL_160MHz          (CLK_APLLCTL_NR(3UL) | CLK_APLLCTL_NF( 40UL) | CLK_APLLCTL_NO_2) /*!< Predefined APLLCTL setting for 160MHz APLL output with 12MHz \hideinitializer */
#define CLK_APLLCTL_180MHz          (CLK_APLLCTL_NR(3UL) | CLK_APLLCTL_NF( 45UL) | CLK_APLLCTL_NO_2) /*!< Predefined APLLCTL setting for 180MHz APLL output with 12MHz \hideinitializer */
#define CLK_APLLCTL_192MHz          (CLK_APLLCTL_NR(2UL) | CLK_APLLCTL_NF( 32UL) | CLK_APLLCTL_NO_2) /*!< Predefined APLLCTL setting for 192MHz APLL output with 12MHz \hideinitializer */
#define CLK_APLLCTL_200MHz          (CLK_APLLCTL_NR(3UL) | CLK_APLLCTL_NF( 25UL) | CLK_APLLCTL_NO_1) /*!< Predefined APLLCTL setting for 200MHz APLL output with 12MHz \hideinitializer */
#define CLK_APLLCTL_220MHz          (CLK_APLLCTL_NR(3UL) | CLK_APLLCTL_NF( 55UL) | CLK_APLLCTL_NO_2) /*!< Predefined APLLCTL setting for 200MHz APLL output with 12MHz \hideinitializer */
#define CLK_APLLCTL_384MHz          (CLK_APLLCTL_NR(2UL) | CLK_APLLCTL_NF( 32UL) | CLK_APLLCTL_NO_1) /*!< Predefined APLLCTL setting for 384MHz APLL output with 12MHz \hideinitializer */

#define CLK_APLLCTL_STBSEL_820     (0UL << CLK_APLL0CTL_STBSEL_Pos)    /*!< Select APLL stable time is 820 APLL source clock \hideinitializer */
#define CLK_APLLCTL_STBSEL_2460    (1UL << CLK_APLL0CTL_STBSEL_Pos)    /*!< Select APLL stable time is 2460 APLL source clock \hideinitializer */
#define CLK_APLLCTL_STBSEL_4920    (2UL << CLK_APLL0CTL_STBSEL_Pos)    /*!< Select APLL stable time is 4920 APLL source clock \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  MODULE constant definitions.                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
#define MODULE_CLKCTL_BASE      (0x40001200UL)
#define MODULE_CLKSEL_BASE      (0x40001400UL)
#define MODULE_CLKDIV_BASE      (0x40001500UL)

#define MODULE_CLKCTL(x)        (((x) >> 47) & 0xffUL)   /*!< Calculate CLKCTL offset \hideinitializer */
#define MODULE_CLKSEL(x)        (((x) >> 39) & 0xffUL)   /*!< Calculate CLKSEL offset \hideinitializer */
#define MODULE_CLKDIV(x)        (((x) >> 31) & 0xffUL)   /*!< Calculate CLKDIV offset \hideinitializer */
#define MODULE_CLKSEL_Msk(x)    (((x) >> 23) & 0xffUL)   /*!< Calculate CLKSEL mask offset on MODULE index \hideinitializer */
#define MODULE_CLKDIV_Msk(x)    (((x) >> 15) & 0xffUL)   /*!< Calculate CLKDIV mask offset on MODULE index \hideinitializer */
#define MODULE_CLKEN_Pos(x)     (((x) >> 10) & 0x1fUL)   /*!< Calculate CLKEN offset on MODULE index \hideinitializer */
#define MODULE_CLKSEL_Pos(x)    (((x) >>  5) & 0x1fUL)   /*!< Calculate CLKSEL position offset on MODULE index \hideinitializer */
#define MODULE_CLKDIV_Pos(x)    (((x) >>  0) & 0x1fUL)   /*!< Calculate CLKDIV position offset on MODULE index \hideinitializer */

#define MODULE_NoMsk            0x0ULL                   /*!< Not mask on MODULE index \hideinitializer */
#define NA                      MODULE_NoMsk             /*!< Not Available \hideinitializer */

#define MODULE_CLKCTL_ENC(x)        (((x) & 0xffUL) << 47)   /*!< CLKCTL offset \hideinitializer */
#define MODULE_CLKSEL_ENC(x)        (((x) & 0xffUL) << 39)   /*!< CLKSEL offset \hideinitializer */
#define MODULE_CLKDIV_ENC(x)        (((x) & 0xffUL) << 31)   /*!< CLKDIV offset \hideinitializer */
#define MODULE_CLKSEL_Msk_ENC(x)    (((x) & 0xffUL) << 23)   /*!< CLKSEL mask offset on MODULE index \hideinitializer */
#define MODULE_CLKDIV_Msk_ENC(x)    (((x) & 0xffUL) << 15)   /*!< CLKDIV mask offset on MODULE index \hideinitializer */
#define MODULE_CLKEN_Pos_ENC(x)     (((x) & 0x1fUL) << 10)   /*!< CLKEN offset on MODULE index \hideinitializer */
#define MODULE_CLKSEL_Pos_ENC(x)    (((x) & 0x1fUL) <<  5)   /*!< CLKSEL position offset on MODULE index \hideinitializer */
#define MODULE_CLKDIV_Pos_ENC(x)    (((x) & 0x1fUL) <<  0)   /*!< CLKDIV position offset on MODULE index \hideinitializer */

#define ACMP01_MODULE   (MODULE_CLKCTL_ENC( 0ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_ACMPCTL_ACMP01CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< ACMP01 Module */

