OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define ACMP23_MODULE   (MODULE_CLKCTL_ENC( 0ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_ACMPCTL_ACMP23CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< ACMP23 Module */

#define AWF0_MODULE     (MODULE_CLKCTL_ENC( 1ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_AWFCTL_AWF0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< AWF0 Module */

#define BPWM0_MODULE    (MODULE_CLKCTL_ENC( 2ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_BPWMCTL_BPWM0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 1ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_BPWMSEL_BPWM0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< BPWM0 Module */

#define BPWM1_MODULE    (MODULE_CLKCTL_ENC( 2ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_BPWMCTL_BPWM1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 1ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_BPWMSEL_BPWM1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< BPWM1 Module */

#define CANFD0_MODULE   (MODULE_CLKCTL_ENC( 3ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_CANFDCTL_CANFD0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 2ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_CANFDSEL_CANFD0SEL_Pos)|\
                         MODULE_CLKDIV_ENC( 4ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_CANFDDIV_CANFD0DIV_Pos))      /*!< CANFD0 Module */

#define CANFD1_MODULE   (MODULE_CLKCTL_ENC( 3ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_CANFDCTL_CANFD1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 2ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_CANFDSEL_CANFD1SEL_Pos)|\
                         MODULE_CLKDIV_ENC( 4ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_CANFDDIV_CANFD1DIV_Pos))      /*!< CANFD1 Module */

#define CCAP0_MODULE    (MODULE_CLKCTL_ENC( 4ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_CCAPCTL_CCAP0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 3ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_CCAPSEL_CCAP0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< CCAP0 Module */

#define CRC0_MODULE     (MODULE_CLKCTL_ENC( 5ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_CRCCTL_CRC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< CRC0 Module */

#define CRYPTO0_MODULE  (MODULE_CLKCTL_ENC( 6ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_CRYPTOCTL_CRYPTO0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< CRYPTO0 Module */

#define DAC01_MODULE    (MODULE_CLKCTL_ENC( 7ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_DACCTL_DAC01CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< DAC01 Module */

#define DMIC0_MODULE    (MODULE_CLKCTL_ENC( 8ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_DMICCTL_DMIC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 5ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_DMICSEL_DMIC0SEL_Pos)|\
                         MODULE_CLKDIV_ENC( 5ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_DMICDIV_DMIC0DIV_Pos))        /*!< DMIC0 Module */

#define VAD0SEL_MODULE  (MODULE_CLKCTL_ENC( 8ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_DMICCTL_DMIC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 5ULL)|MODULE_CLKSEL_Msk_ENC( 0x3ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_DMICSEL_VAD0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(NA)|MODULE_CLKDIV_Pos_ENC(NA))                                             /*!< VAD0SEL Module */

#define EADC0_MODULE    (MODULE_CLKCTL_ENC( 9ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EADCCTL_EADC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 6ULL)|MODULE_CLKSEL_Msk_ENC( 0x3ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_EADCSEL_EADC0SEL_Pos)|\
                         MODULE_CLKDIV_ENC( 6ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_EADCDIV_EADC0DIV_Pos))        /*!< EADC0 Module */

#define EBI0_MODULE     (MODULE_CLKCTL_ENC(10ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EBICTL_EBI0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< EBI0 Module */

#define ECAP0_MODULE    (MODULE_CLKCTL_ENC(11ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_ECAPCTL_ECAP0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< ECAP0 Module */

#define ECAP1_MODULE    (MODULE_CLKCTL_ENC(11ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_ECAPCTL_ECAP1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< ECAP1 Module */

