OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define ECAP2_MODULE    (MODULE_CLKCTL_ENC(11ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_ECAPCTL_ECAP2CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< ECAP2 Module */

#define ECAP3_MODULE    (MODULE_CLKCTL_ENC(11ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_ECAPCTL_ECAP3CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< ECAP3 Module */

#define EMAC0_MODULE    (MODULE_CLKCTL_ENC(12ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EMACCTL_EMAC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< EMAC0 Module */

#define EPWM0_MODULE    (MODULE_CLKCTL_ENC(13ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EPWMCTL_EPWM0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 7ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_EPWMSEL_EPWM0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< EPWM0 Module */

#define EPWM1_MODULE    (MODULE_CLKCTL_ENC(13ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EPWMCTL_EPWM1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 7ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_EPWMSEL_EPWM1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< EPWM1 Module */

#define EQEI0_MODULE    (MODULE_CLKCTL_ENC(14ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EQEICTL_EQEI0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< EQEI0 Module */

#define EQEI1_MODULE    (MODULE_CLKCTL_ENC(14ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EQEICTL_EQEI1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< EQEI1 Module */

#define EQEI2_MODULE    (MODULE_CLKCTL_ENC(14ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EQEICTL_EQEI2CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< EQEI2 Module */

#define EQEI3_MODULE    (MODULE_CLKCTL_ENC(14ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_EQEICTL_EQEI3CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< EQEI3 Module */

#define FMC0_MODULE     (MODULE_CLKCTL_ENC(15ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_FMCCTL_FMC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 8ULL)|MODULE_CLKSEL_Msk_ENC(   1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_FMCSEL_FMC0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< FMC0 Module */

#define ISP0_MODULE     (MODULE_CLKCTL_ENC(15ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_FMCCTL_ISP0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< ISP0 Module */

#define GDMA0_MODULE    (MODULE_CLKCTL_ENC(16ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GDMACTL_GDMA0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GDMA0 Module */

#define GPIOA_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOACKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOA Module */

#define GPIOB_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOBCKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOB Module */

#define GPIOC_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOCCKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOC Module */

#define GPIOD_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIODCKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOD Module */

