OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define GPIOE_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOECKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOE Module */

#define GPIOF_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOFCKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOF Module */

#define GPIOG_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOGCKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOG Module */

#define GPIOH_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOHCKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOH Module */

#define GPIOI_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOICKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOI Module */

#define GPIOJ_MODULE    (MODULE_CLKCTL_ENC(17ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_GPIOCTL_GPIOJCKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< GPIOJ Module */

#define HSOTG0_MODULE   (MODULE_CLKCTL_ENC(18ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_HSOTGCTL_HSOTG0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< HSOTG0 Module */

#define HSUSBD0_MODULE  (MODULE_CLKCTL_ENC(19ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_HSUSBDCTL_HSUSBD0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< HSUSBD0 Module */

#define HSUSBH0_MODULE  (MODULE_CLKCTL_ENC(20ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_HSUSBHCTL_HSUSBH0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< HSUSBH0 Module */

#define I2C0_MODULE     (MODULE_CLKCTL_ENC(21ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_I2CCTL_I2C0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< I2C0 Module */

#define I2C1_MODULE     (MODULE_CLKCTL_ENC(21ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_I2CCTL_I2C1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< I2C1 Module */

#define I2C2_MODULE     (MODULE_CLKCTL_ENC(21ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_I2CCTL_I2C2CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< I2C2 Module */

#define I2C3_MODULE     (MODULE_CLKCTL_ENC(21ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_I2CCTL_I2C3CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< I2C3 Module */

#define I2S0_MODULE     (MODULE_CLKCTL_ENC(22ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_I2SCTL_I2S0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 9ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_I2SSEL_I2S0SEL_Pos)|\
                         MODULE_CLKDIV_ENC( 7ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_I2SDIV_I2S0DIV_Pos))          /*!< I2S0 Module */

#define I2S1_MODULE     (MODULE_CLKCTL_ENC(22ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_I2SCTL_I2S1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC( 9ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_I2SSEL_I2S1SEL_Pos)|\
                         MODULE_CLKDIV_ENC( 7ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_I2SDIV_I2S1DIV_Pos))          /*!< I2S1 Module */

#define I3C0_MODULE     (MODULE_CLKCTL_ENC(23ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_I3CCTL_I3C0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(10ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_I3CSEL_I3C0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< I3C0 Module */

#define KDF0_MODULE     (MODULE_CLKCTL_ENC(24ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_KDFCTL_KDF0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< KDF0 Module */

#define KPI0_MODULE     (MODULE_CLKCTL_ENC(25ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_KPICTL_KPI0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(11ULL)|MODULE_CLKSEL_Msk_ENC( 0x3ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_KPISEL_KPI0SEL_Pos)|\
                         MODULE_CLKDIV_ENC( 8ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_KPIDIV_KPI0DIV_Pos))          /*!< KPI0 Module */

#define KS0_MODULE      (MODULE_CLKCTL_ENC(26ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_KSCTL_KS0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< KS0 Module */

#define LPADC0_MODULE   (MODULE_CLKCTL_ENC(27ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPADCCTL_LPADC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(12ULL)|MODULE_CLKSEL_Msk_ENC( 0x3ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_LPADCSEL_LPADC0SEL_Pos)|\
                         MODULE_CLKDIV_ENC( 9ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_LPADCDIV_LPADC0DIV_Pos))      /*!< LPADC0 Module */

#define LPPDMA0_MODULE  (MODULE_CLKCTL_ENC(28ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPPDMACTL_LPPDMA0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< LPPDMA0 Module */

#define LPGPIO0_MODULE  (MODULE_CLKCTL_ENC(29ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPGPIOCTL_LPGPIO0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< LPGPIO0 Module */

#define LPI2C0_MODULE   (MODULE_CLKCTL_ENC(30ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPI2CCTL_LPI2C0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< LPI2C0 Module */

#define LPSPI0_MODULE   (MODULE_CLKCTL_ENC(31ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPSPICTL_LPSPI0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(13ULL)|MODULE_CLKSEL_Msk_ENC( 0x3ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_LPSPISEL_LPSPI0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< LPSPI0 Module */

