OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define LPSRAM0_MODULE  (MODULE_CLKCTL_ENC(32ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPSRAMCTL_LPSRAM0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< LPSRAM0 Module */

#define LPTMR0_MODULE   (MODULE_CLKCTL_ENC(33ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPTMRCTL_LPTMR0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(14ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_LPTMRSEL_LPTMR0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< LPTMR0 Module */

#define LPTMR1_MODULE   (MODULE_CLKCTL_ENC(33ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPTMRCTL_LPTMR1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(14ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_LPTMRSEL_LPTMR1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< LPTMR1 Module */

#define LPUART0_MODULE  (MODULE_CLKCTL_ENC(34ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_LPUARTCTL_LPUART0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(15ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_LPUARTSEL_LPUART0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(10ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_LPUARTDIV_LPUART0DIV_Pos))    /*!< LPUART0 Module */

#define NPU0_MODULE     (MODULE_CLKCTL_ENC(35ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_NPUCTL_NPU0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< NPU0 Module */

#define OTFC0_MODULE    (MODULE_CLKCTL_ENC(37ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_OTFCCTL_OTFC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< OTFC0 Module */

#define OTG0_MODULE     (MODULE_CLKCTL_ENC(38ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_OTGCTL_OTG0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< OTG0 Module */

#define PDMA0_MODULE    (MODULE_CLKCTL_ENC(39ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_PDMACTL_PDMA0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< PDMA0 Module */

#define PDMA1_MODULE    (MODULE_CLKCTL_ENC(39ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_PDMACTL_PDMA1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< PDMA1 Module */

#define PSIO0_MODULE    (MODULE_CLKCTL_ENC(40ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_PSIOCTL_PSIO0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(16ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_PSIOSEL_PSIO0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(11ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_PSIODIV_PSIO0DIV_Pos))        /*!< PSIO0 Module */

#define QSPI0_MODULE    (MODULE_CLKCTL_ENC(41ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_QSPICTL_QSPI0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(17ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_QSPISEL_QSPI0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< QSPI0 Module */

#define QSPI1_MODULE    (MODULE_CLKCTL_ENC(41ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_QSPICTL_QSPI1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(17ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_QSPISEL_QSPI1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< QSPI1 Module */

#define RTC0_MODULE     (MODULE_CLKCTL_ENC(42ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_RTCCTL_RTC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< RTC0 Module */

#define SC0_MODULE      (MODULE_CLKCTL_ENC(43ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SCCTL_SC0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(18ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SCSEL_SC0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(12ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_SCDIV_SC0DIV_Pos))            /*!< SC0 Module */

#define SC1_MODULE      (MODULE_CLKCTL_ENC(43ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SCCTL_SC1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(18ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SCSEL_SC1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(12ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_SCDIV_SC1DIV_Pos))            /*!< SC1 Module */

#define SC2_MODULE      (MODULE_CLKCTL_ENC(43ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SCCTL_SC2CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(18ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SCSEL_SC2SEL_Pos)|\
                         MODULE_CLKDIV_ENC(12ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_SCDIV_SC2DIV_Pos))            /*!< SC2 Module */

#define SCU0_MODULE     (MODULE_CLKCTL_ENC(44ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SCUCTL_SCU0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SCU0 Module */

#define SDH0_MODULE     (MODULE_CLKCTL_ENC(45ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SDHCTL_SDH0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(19ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SDHSEL_SDH0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(13ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_SDHDIV_SDH0DIV_Pos))          /*!< SDH0 Module */

#define SDH1_MODULE     (MODULE_CLKCTL_ENC(45ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SDHCTL_SDH1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(19ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SDHSEL_SDH1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(13ULL)|MODULE_CLKDIV_Msk_ENC(0xFFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_SDHDIV_SDH1DIV_Pos))          /*!< SDH1 Module */

#define SPI0_MODULE     (MODULE_CLKCTL_ENC(46ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SPICTL_SPI0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(20ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SPISEL_SPI0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SPI0 Module */

