OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define SPI1_MODULE     (MODULE_CLKCTL_ENC(46ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SPICTL_SPI1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(20ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SPISEL_SPI1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SPI1 Module */

#define SPI2_MODULE     (MODULE_CLKCTL_ENC(46ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SPICTL_SPI2CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(20ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SPISEL_SPI2SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SPI2 Module */

#define SPI3_MODULE     (MODULE_CLKCTL_ENC(46ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SPICTL_SPI3CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(20ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_SPISEL_SPI3SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SPI3 Module */

#define SPIM0_MODULE    (MODULE_CLKCTL_ENC(47ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SPIMCTL_SPIM0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SPIM0 Module */

#define SRAM0_MODULE    (MODULE_CLKCTL_ENC(48ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SRAMCTL_SRAM0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SRAM0 Module */

#define SRAM1_MODULE    (MODULE_CLKCTL_ENC(48ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SRAMCTL_SRAM1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SRAM1 Module */

#define SRAM2_MODULE    (MODULE_CLKCTL_ENC(48ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_SRAMCTL_SRAM2CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< SRAM2 Module */

#define ST0_MODULE      (MODULE_CLKCTL_ENC(51ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_STCTL_ST0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))            							   /*!< ST0 Module */

#define TMR0_MODULE     (MODULE_CLKCTL_ENC(53ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_TMRCTL_TMR0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(22ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_TMRSEL_TMR0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< TMR0 Module */

#define TMR1_MODULE     (MODULE_CLKCTL_ENC(53ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_TMRCTL_TMR1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(22ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_TMRSEL_TMR1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< TMR1 Module */

#define TMR2_MODULE     (MODULE_CLKCTL_ENC(53ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_TMRCTL_TMR2CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(22ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_TMRSEL_TMR2SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< TMR2 Module */

#define TMR3_MODULE     (MODULE_CLKCTL_ENC(53ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_TMRCTL_TMR3CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(22ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_TMRSEL_TMR3SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< TMR3 Module */

#define TRNG0_MODULE    (MODULE_CLKCTL_ENC(54ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_TRNGCTL_TRNG0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< TRNG0 Module */

#define TTMR0_MODULE    (MODULE_CLKCTL_ENC(55ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_TTMRCTL_TTMR0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(23ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_TTMRSEL_TTMR0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< TTMR0 Module */

#define TTMR1_MODULE    (MODULE_CLKCTL_ENC(55ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_TTMRCTL_TTMR1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(23ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_TTMRSEL_TTMR1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< TTMR1 Module */

