OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define UART0_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(24ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL0_UART0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(15ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV0_UART0DIV_Pos))       /*!< UART0 Module */

#define UART1_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(24ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL0_UART1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(15ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV0_UART1DIV_Pos))       /*!< UART1 Module */

#define UART2_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART2CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(24ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL0_UART2SEL_Pos)|\
                         MODULE_CLKDIV_ENC(15ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV0_UART2DIV_Pos))       /*!< UART2 Module */

#define UART3_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART3CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(24ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL0_UART3SEL_Pos)|\
                         MODULE_CLKDIV_ENC(15ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV0_UART3DIV_Pos))       /*!< UART3 Module */

#define UART4_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART4CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(24ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL0_UART4SEL_Pos)|\
                         MODULE_CLKDIV_ENC(15ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV0_UART4DIV_Pos))       /*!< UART4 Module */

#define UART5_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART5CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(24ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL0_UART5SEL_Pos)|\
                         MODULE_CLKDIV_ENC(15ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV0_UART5DIV_Pos))       /*!< UART5 Module */

#define UART6_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART6CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(24ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL0_UART6SEL_Pos)|\
                         MODULE_CLKDIV_ENC(15ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV0_UART6DIV_Pos))       /*!< UART6 Module */

#define UART7_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART7CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(24ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL0_UART7SEL_Pos)|\
                         MODULE_CLKDIV_ENC(15ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV0_UART7DIV_Pos))       /*!< UART7 Module */

#define UART8_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART8CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(25ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL1_UART8SEL_Pos)|\
                         MODULE_CLKDIV_ENC(16ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV1_UART8DIV_Pos))       /*!< UART8 Module */

#define UART9_MODULE    (MODULE_CLKCTL_ENC(56ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UARTCTL_UART9CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(25ULL)|MODULE_CLKSEL_Msk_ENC( 0x7ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_UARTSEL1_UART9SEL_Pos)|\
                         MODULE_CLKDIV_ENC(16ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_UARTDIV1_UART9DIV_Pos))       /*!< UART9 Module */

#define USBD0_MODULE    (MODULE_CLKCTL_ENC(57ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_USBDCTL_USBD0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(26ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_USBSEL_USBSEL_Pos)|\
                         MODULE_CLKDIV_ENC(17ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_USBDIV_USBDIV_Pos))           /*!< USBD0 Module */

#define USBH0_MODULE    (MODULE_CLKCTL_ENC(58ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_USBHCTL_USBH0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(26ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_USBSEL_USBSEL_Pos)|\
                         MODULE_CLKDIV_ENC(17ULL)|MODULE_CLKDIV_Msk_ENC( 0xFULL)|MODULE_CLKDIV_Pos_ENC((uint64_t)CLK_USBDIV_USBDIV_Pos))           /*!< USBH0 Module */

#define USCI0_MODULE    (MODULE_CLKCTL_ENC(59ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_USCICTL_USCI0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< USCI0 Module */

#define UTCPD0_MODULE   (MODULE_CLKCTL_ENC(60ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_UTCPDCTL_UTCPD0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(   NA)|MODULE_CLKSEL_Msk_ENC(     NA)|MODULE_CLKSEL_Pos_ENC(NA)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< UTCPD0 Module */

#define WDT0_MODULE     (MODULE_CLKCTL_ENC(61ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_WDTCTL_WDT0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(27ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_WDTSEL_WDT0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< WDT0 Module */

#define WDT1_MODULE     (MODULE_CLKCTL_ENC(61ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_WDTCTL_WDT1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(27ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_WDTSEL_WDT1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< WDT1 Module */

