OpenNuvoton/NuTool-ClockConfigure/Header/M55M1/clk.h
#define WWDT0_MODULE    (MODULE_CLKCTL_ENC(62ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_WWDTCTL_WWDT0CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(31ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_WWDTSEL_WWDT0SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< WWDT0 Module */

#define WWDT1_MODULE    (MODULE_CLKCTL_ENC(62ULL)|MODULE_CLKEN_Pos_ENC((uint64_t)CLK_WWDTCTL_WWDT1CKEN_Pos)|\
                         MODULE_CLKSEL_ENC(31ULL)|MODULE_CLKSEL_Msk_ENC( 0x1ULL)|MODULE_CLKSEL_Pos_ENC((uint64_t)CLK_WWDTSEL_WWDT1SEL_Pos)|\
                         MODULE_CLKDIV_ENC(   NA)|MODULE_CLKDIV_Msk_ENC(     NA)|MODULE_CLKDIV_Pos_ENC(NA))                                        /*!< WWDT1 Module */

/*---------------------------------------------------------------------------------------------------------*/
/*  CLKO constant definitions.                                                                             */
/*---------------------------------------------------------------------------------------------------------*/
#define CLK_CLKOCTL_DIV1EN_DIV_FREQSEL      0UL
#define CLK_CLKOCTL_DIV1EN_DIV_1            1UL


/** @} end of group CLK_EXPORTED_CONSTANTS */

/** @addtogroup CLK_EXPORTED_FUNCTIONS CLK Exported Functions
  @{
*/

/**
  * @brief      Set SCLK Divider
  * @param      u32SclkDiv is SCLK clock divider.  It could be 1~16
  * @return     None
  * @details    This macro set SCLK clock divider
  */
#define CLK_SET_SCLKDIV(u32SclkDiv)        (CLK->SCLKDIV = (CLK->SCLKDIV & (~CLK_SCLKDIV_SCLKDIV_Msk)) | CLK_SCLKDIV_SCLKDIV(u32SclkDiv))

/**
  * @brief      Set HCLK2 Divider
  * @param      u32Hclk2Div is HCLK2 clock divider.  It could be 1~16
  * @return     None
  * @details    This macro set HCLK2 clock divider
  */
#define CLK_SET_HCLK2DIV(u32Hclk2Div)        (CLK->HCLKDIV = (CLK->HCLKDIV & (~CLK_HCLKDIV_HCLK2DIV_Msk)) | CLK_HCLKDIV_HCLK2DIV(u32Hclk2Div))

/**
  * @brief      Set PCLK0 Divider
  * @param      u32PCLK0Div is PCLK0 clock divider.  It could be 1~16
  * @return     None
  * @details    This macro set PCLK0 clock divider
  */
#define CLK_SET_PCLK0DIV(u32PCLK0Div)        (CLK->PCLKDIV = (CLK->PCLKDIV & (~CLK_PCLKDIV_PCLK0DIV_Msk)) | CLK_PCLKDIV_PCLK0DIV(u32PCLK0Div))

/**
  * @brief      Set PCLK1 Divider
  * @param      u32PCLK1Div is PCLK1 clock divider.  It could be 1~16
  * @return     None
  * @details    This macro set PCLK1 clock divider
  */
#define CLK_SET_PCLK1DIV(u32PCLK1Div)        (CLK->PCLKDIV = (CLK->PCLKDIV & (~CLK_PCLKDIV_PCLK1DIV_Msk)) | CLK_PCLKDIV_PCLK1DIV(u32PCLK1Div))

/**
  * @brief      Set PCLK2 Divider
  * @param      u32PCLK2Div is PCLK2 clock divider.  It could be 1~16
  * @return     None
  * @details    This macro set PCLK2 clock divider
  */
#define CLK_SET_PCLK2DIV(u32PCLK2Div)        (CLK->PCLKDIV = (CLK->PCLKDIV & (~CLK_PCLKDIV_PCLK2DIV_Msk)) | CLK_PCLKDIV_PCLK2DIV(u32PCLK2Div))

/**
  * @brief      Set PCLK3 Divider
  * @param      u32PCLK3Div is PCLK3 clock divider.  It could be 1~16
  * @return     None
  * @details    This macro set PCLK3 clock divider
  */
#define CLK_SET_PCLK3DIV(u32PCLK3Div)        (CLK->PCLKDIV = (CLK->PCLKDIV & (~CLK_PCLKDIV_PCLK3DIV_Msk)) | CLK_PCLKDIV_PCLK3DIV(u32PCLK3Div))

/**
  * @brief      Set PCLK4 Divider
  * @param      u32PCLK4Div is PCLK4 clock divider.  It could be 1~16
  * @return     None
  * @details    This macro set PCLK4 clock divider
  */
#define CLK_SET_PCLK4DIV(u32PCLK4Div)        (CLK->PCLKDIV = (CLK->PCLKDIV & (~CLK_PCLKDIV_PCLK4DIV_Msk)) | CLK_PCLKDIV_PCLK4DIV(u32PCLK4Div))

/**
  * @brief      Set System Tick Divider
  * @param      u32ST0Div is system tick clock divider.  It could be 1~256
  * @return     None
  * @details    This macro set system tick clock divider
  */
#define CLK_SET_STDIV(u32ST0Div)        (CLK->STDIV = (CLK->STDIV & (~CLK_STDIV_ST0DIV_Msk)) | CLK_STDIV_ST0DIV(u32ST0Div))

void CLK_DisableCKO(void);
void CLK_EnableCKO(uint32_t u32ClkSrc, uint32_t u32ClkDiv, uint32_t u32ClkDivBy1En);
void CLK_DisableMIRC(void);
uint32_t CLK_EnableMIRC(uint32_t u32MircFreq);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetHXTFreq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetLXTFreq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetMIRCFreq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetSCLKFreq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetACLKFreq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetHCLK0Freq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetHCLK1Freq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetHCLK2Freq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetPCLK0Freq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetPCLK1Freq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetPCLK2Freq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetPCLK3Freq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetPCLK4Freq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetPCLK5Freq(void);
uint32_t CLK_SetCoreClock(uint32_t u32Aclk);
void CLK_SetSCLK(uint32_t u32ClkSrc);
uint32_t CLK_SetBusClock(uint32_t u32SCLKSrc, uint32_t u32PllClkSrc, uint32_t u32PllFreq);
void CLK_SetModuleClock(uint64_t u64ModuleIdx, uint32_t u32ClkSrc, uint32_t u32ClkDiv);
void CLK_SetSysTickClockSrc(uint32_t u32ClkSrc);
void CLK_EnableXtalRC(uint32_t u32ClkMask);
void CLK_DisableXtalRC(uint32_t u32ClkMask);
void CLK_EnableModuleClock(uint64_t u64ModuleIdx);
void CLK_DisableModuleClock(uint64_t u64ModuleIdx);
uint32_t CLK_EnableAPLL(uint32_t u32APLLClkSrc, uint32_t u32APLLFreq, uint32_t u32APLLSelect);
void CLK_DisableAPLL(uint32_t u32APLLSelect);
uint32_t CLK_WaitClockReady(uint32_t u32ClkMask);
uint32_t CLK_WaitClockDisable(uint32_t u32ClkMask);
void CLK_EnableSysTick(uint32_t u32ClkSrc, uint32_t u32Count);
void CLK_DisableSysTick(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetAPLL0ClockFreq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetAPLL1ClockFreq(void);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetModuleClockSource(uint64_t u64ModuleIdx);
__NONSECURE_ENTRY_WEAK uint32_t CLK_GetModuleClockDivider(uint64_t u64ModuleIdx);
__NONSECURE_ENTRY_WEAK uint32_t CLK_SystemClockUpdate(void);
void CLK_SysTickDelay(uint32_t us);
void CLK_SysTickLongDelay(uint32_t us);

/** @} end of group CLK_EXPORTED_FUNCTIONS */

/** @} end of group CLK_Driver */

/** @} end of group Standard_Driver */

#ifdef __cplusplus
}
#endif

#endif  /* __CLK_H__ */
